geo_logs = [
{'visit1': ['Москва', 'Россия']},
{'visit2': ['Дели', 'Индия']},
{'visit3': ['Владимир', 'Россия']},
{'visit4': ['Лиссабон', 'Португалия']},
{'visit5': ['Париж', 'Франция']},
{'visit6': ['Лиссабон', 'Португалия']},
{'visit7': ['Тула', 'Россия']},
{'visit8': ['Тула', 'Россия']},
{'visit9': ['Курск', 'Россия']},
{'visit10': ['Архангельск', 'Россия']},
]

i = 0
j = 0
filtered_geo_log = []


# Проверка элементов списка на содержание искомых данных и формирование отфильтрованного списка
while i < 10:

    if ('Россия' in str(geo_logs[i])) == 1:
        
        filtered_geo_log.append(geo_logs[i])
        j = j + 1
    i = i + 1

# Печать нового списка, через цикл, а не str(), чтобы красивее выглядело
print ("The visits to Mother Russia:\n")

i = 0
while i < j:
    print (str(filtered_geo_log[i]))
    i = i + 1
